---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.HoleInRoofFailed
source: html/94c9ec8a-0b02-8add-5612-9e027b48d355.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.HoleInRoofFailed Property

Hole(s) could not be cut in roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId HoleInRoofFailed { get; }
```